li = '''1	Ален Б. Думай на Python. Питер, 2009.
		2	 Макфарланд Д. Простой Python. JavaScript и jQuery. Исчерпывающее руководство. Москва, 2016.
		3	 Лутц  М. Изучаем Python. Символ – Плюс, 2011.
		4	 Гринберг М. Разработка веб-приложений с использованием Flask на языке Python. Питер, 2017.
		5	 Фиртман М. jQuery Mobile. Разработка приложений для смартфонов. Питер, 2017.
		6	 Томас Х. Алгоритмы. Вводный курс. Питер, 2014.
		7	 Хейнеман Дж. Алгоритмы. Справочник. Питер, 2017.
		8	 Прохоренок Н. Python3 и PyQt 5. Разработка приложений. Питер, 2019.
		9	 Arbuckle D. Mastering Python. Альфа-книга, 2017.
		10	 Николас З. JavaScript. Оптимизация производительности. Эксмо, 2018.
		11	 Chitipothu A. Python Practice Book. Дрофа, 2014.
		12	 Payne J. Beginnig Python: Using Python 2.6 and Python 3.1. Эксмо, 2010.
		13	 Phillips D. Python Object-Oriented Programming, Эксмо, 2010.
		14	 https://www.python.org/doc/
		15	 https://www.sololearn.com/Course/Python/.
		16	 Аллен Д. Цифровая обработка сигналов на языке Python. O'Reilly Media, 2017.
		17	 Скрабцов Н. Аудит безопасности информационных систем. Питер, 2018.\
		18	 Скамбрэй Д. Безопасность веб-приложений. Вильямс, 2003.
		19	 Даккет Д. HTML и CSS. Разработка и дизайн веб-сайтов. Эксмо, 2016
		20	 Аверченков В. Аудит информационной безопасности. Москва, 2018'''

li = li.split('\n')
# li = li.sort()
print(li)